<?php
$cities = [
    "Москва", "Санкт-Петербург", "Новосибирск", "Екатеринбург", "Казань", 
    "Нижний Новгород", "Челябинск", "Омск", "Самара", "Ростов-на-Дону",
    "Уфа", "Красноярск", "Воронеж", "Пермь", "Краснодар", "Тольятти",
    "Ижевск", "Барнаул", "Ульяновск", "Калуга", "Саранск", "Рязань",
    "Томск", "Астрахань", "Тула", "Мурманск", "Ярославль", "Владивосток",
    "Иркутск", "Кемерово", "Набережные Челны", "Липецк", "Магнитогорск",
    "Архангельск", "Сочи", "Кострома", "Смоленск", "Бийск", "Тверь", "Чита", 
    "Таганрог", "Орёл", "Ставрополь", "Киров", "Саранск", "Северодвинск", 
    "Брянск", "Сургут", "Рыбинск", "Чебоксары", "Калининград", "Курск", 
    "Сызрань", "Нижневартовск", "Ангарск", "Нижний Тагил", "Кострома",
    "Жуковский", "Шахты", "Балашиха", "Владимир", "Грозный"
];

$query = isset($_GET['query']) ? $_GET['query'] : '';

$filteredCities = array_filter($cities, function($city) use ($query) {
    return stripos($city, $query) !== false;
});

echo json_encode(array_values($filteredCities));
?>
